# RailPlacedOutsideOfHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RailPlacedOutsideOfHost Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Railings are placed completely outside the host. It may change the adjustment of the railing to the host and its vertical position.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailPlacedOutsideOfHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailPlacedOutsideOfHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailPlacedOutsideOfHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace